Revit 2027 API
StructuralAsset.WoodParallelShearStrength Property
 The parallel shear strength of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WoodParallelShearStrength { get; set; }
Public Property WoodParallelShearStrength As Double
	Get
	Set
public:
property double WoodParallelShearStrength {
	double get ();
	void set (double value);
}
member WoodParallelShearStrength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be wood to set this property.
Remarks
 Applies to wood-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace